{"acadYear":"2021/2022","description":"Electric Vehicles will start being ubiquitous as means of personal transport. With nations around the world announcing targets for adopting electric vehicles in their vehicular transport mix, growth in this area is going to be inevitable. The module will explain how Electric Vehicle of different types (BEV, PHEV, FCEV) are dimensioned, what are their best operating regimes how they are charged. The dimensioning of key component of EVs such battery systems and traction motor drive trains will be explained. Different charging standards like CHADemo will be presented and the impact of charging infrastructure on the Grid will be explained.","title":"Electric Vehicles and their Grid Integration","department":"Electrical and Computer Engineering","faculty":"Engineering","workload":[1,0.5,0.5,4,4],"prerequisite":"Pre: EE1111A / EE1111B / CG1111A / ME1102 / ESP1111 and EE2111A / CG2111A / ME2104 / ESP1104A / ESP1104B / ESP2111\n\nAdvisory: This Module is open to EE, CEG, ME, ESP students. Students would need to have prior knowledge of Electric Circuits, Mechanics and Computer based modelling of systems, Engineering Principles and Practice: such Mechatronics principles of Force, acceleration, energy, free-body diagrams, Equivalent\nCircuits and their analysis, AC circuits, Concepts of Power, Voltage. Conservation of Energy, How systems work etc.","moduleCredit":"4","moduleCode":"EE4513","semesterData":[{"semester":2,"timetable":[{"classNo":"01","startTime":"1000","endTime":"1100","weeks":[2,3,4,5,6,7,8,9,10,11,12,13],"venue":"LT1","day":"Friday","lessonType":"Packaged Tutorial","size":80,"covidZone":"B"},{"classNo":"01","startTime":"1200","endTime":"1400","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"LT1","day":"Wednesday","lessonType":"Packaged Lecture","size":80,"covidZone":"B"}],"covidZones":["B"]}],"prereqTree":{"and":[{"or":["EE1111A","EE1111B","CG1111A","ME1102","ESP1111"]},{"or":["EE2111A","CG2111A","ME2104","ESP1104A","ESP1104B","ESP2111"]}]}}
