{"moduleCode":"EE5907","title":"Pattern Recognition","description":"Pattern recognition deals with automated classification, identification, and/or characterizations of signals/data from various sources. The main objectives of this graduate module are to equip students with knowledge of common statistical pattern recognition (PR) algorithms and techniques. Course will contain project-based work involving use of PR algorithms. Upon completion of this module, students will be able to analyze a given pattern recognition problem, and determine which standard technique is applicable, or be able to modify existing algorithms to engineer new algorithms to solve the problem. Topics covered include: Decision theory, Parameter estimation, Density estimation, Non-parametric techniques, Supervised learning, Dimensionality reduction, Linear discriminant functions, Clustering, Unsupervised learning, Feature extraction and Applications.","moduleCredit":4.0,"department":"Electrical and Computer Engineering","faculty":"Engineering","prerequisite":"[applicable to UG level students only] (EE2012 / EE2012A / ST2334 / ST1131 / ST2131 / CE2407 / CE2407A / BN2102 or equivalent) AND EE3731C AND (CS1010E / CS1010 / CS1010S / CS1010X / IT1007 / CS1101S or equivalent). The programming assignments will be in matlab or python (student gets to choose the language but the language won’t be taught in class). Students should also have at least a basic linear algebra background. It is also worth noting that this is a 5000-level course, so it\u0027s expected to be significantly harder than a 4000-level class. \n\nor \n\n“[Advisory applicable to GD level students only] Requires background knowledge in probability/statistics, programming (python/matlab) and linear algebra that are typically covered in an undergraduate engineering program.","preclusion":"EE5907R, EE5026 or EE5027","acadYear":"2021/2022","attributes":{"mpes1":true,"mpes2":false,"su":false},"semesterData":[{"semester":1,"examDate":"Nov 26, 2021, 9:00:00 AM","examDuration":120,"timetable":[{"classNo":"01","startTime":1800,"endTime":2100,"venue":"E-Learn_A","day":"Thursday","lessonType":"Lecture","size":205}]}]}