{"moduleCode":"LL6348","title":"Monetary Law in Comparative Perspective","description":"Money is an all-pervasive legal concept, and an integral part of public dealings by the state and most private transactions. The module aims to develop a distinctive understanding of the legal institution of money, seen as a subject in itself, from private law and public law perspectives.  Although the course may be of interest to those with a background in financial or banking regulation, it deliberately avoids considering the subject of money from those perspectives. It is primarily concerned with the common law of money, as it would apply in Singapore.  It does however draw on the comparative perspectives from mixed and civil law jurisdictions, and from legal history.  Together these demonstrate the broad functional commonalities that any legal system must develop if is construct a legal notion of money and main purposes its serves in the economy.\n\nThe module explains the role of law in the creation of money and in the ordering of a monetary system.  It explains how law has a role to play in recognising and enforcing concepts of monetary value in private transactions.  It considers the distinctive ways that property law applies to money, including the role of property law in controlling the consequences of failed or wrongly-procured payment transactions.  The module considers the capacity of private law to respond to the special problems of monetary transactions involving a foreign currency system, and the legal challenges posed by new monetary developments such as cyber-currencies.","moduleCredit":4.0,"department":"FoL Dean\u0027s Office","faculty":"Law","prerequisite":"NUS Compulsory Core Law Curriculum or equivalent.\nLaw of Contract; Principles of Property Law; Equity and Trusts","preclusion":"LL4348V/LL5348V/LL6348V Monetary Law in Comparative Perspective","acadYear":"2021/2022","semesterData":[{"semester":2,"examDuration":0,"timetable":[{"classNo":"1","startTime":1830,"endTime":2130,"venue":"E-Hybrid_D","day":"Wednesday","lessonType":"Seminar-Style Module Class","size":1},{"classNo":"1","startTime":1830,"endTime":2130,"venue":"E-Hybrid_D","day":"Monday","lessonType":"Seminar-Style Module Class","size":1},{"classNo":"1","startTime":1430,"endTime":1730,"venue":"E-Hybrid_D","day":"Friday","lessonType":"Seminar-Style Module Class","size":1}]}]}