{"moduleCode":"MA1301","title":"Introductory Mathematics","description":"This module serves as a bridging module for students without \u0027A\u0027 - level mathematics. Its aim is to equip students with appropriate mathematical knowledge and skill so as to prepare them for further study of mathematics-related disciplines. At the end of the course, students are expected to attain a level of proficiency in algebra and calculus equivalent to the GCE Advanced Level. Major topics: Sets, functions and graphs, polynomials and rational functions, inequalities in one variable, logarithmic and exponential functions, trigonometric functions, sequences and series, techniques of differentiation, applications of differentiation, maxima and minima, increasing and decreasing functions, curve sketching, techniques of integration, applications of integration, areas, volumes of solids of revolution, solution of first order ordinary differential equations by separation of variables and by integrating factor, complex numbers, vectors.","moduleCredit":4.0,"department":"Mathematics","faculty":"Science","prerequisite":"Pass in GCE ‘O’ Level Additional Mathematics or GCE ‘AO’ Levels or H1 Mathematics","preclusion":"Those with A-level or H2 passes in Mathematics or H2 Further Mathematics or who have passed any of the modules MA1101R, MA1102R, MA1301FC, MA1301X, MA1505, MA1506, MA1507, MA1508, MA1521, MA1311, MA1312, MA1421, MPE students","acadYear":"2021/2022","attributes":{"mpes1":true,"mpes2":true,"su":true},"semesterData":[{"semester":1,"examDate":"Nov 29, 2021, 5:00:00 PM","examDuration":120,"timetable":[{"classNo":"1","startTime":1000,"endTime":1200,"venue":"E-Learn_B","day":"Thursday","lessonType":"Lecture","size":610},{"classNo":"1","startTime":1000,"endTime":1200,"venue":"E-Learn_B","day":"Monday","lessonType":"Lecture","size":610}]},{"semester":2,"examDate":"May 5, 2022, 9:00:00 AM","examDuration":120,"timetable":[{"classNo":"1","startTime":1400,"endTime":1600,"venue":"S17-0611","day":"Friday","lessonType":"Tutorial","size":30},{"classNo":"1","startTime":1400,"endTime":1600,"venue":"LT33","day":"Tuesday","lessonType":"Lecture","size":100}]}]}