{"moduleCode":"MA1312","title":"Calculus with Applications","description":"This module contains the main ideas of calculus that are often encountered in the formulation and solution of practical problems. The approach of this course is intuitive and heuristic. The objective is to develop a competent working knowledge of the main concepts and methods introduced. This module is also designed for students who intend to do a minor in mathematics or for those who are keen to pick up some mathematical skills that might be useful in their own areas of studies. \n\n\n\nMajor topics: Real numbers and elementary analytic geometry. Functions, limits, continuity and derivative. Trigonometric functions. Trigonometric functions. Applications of the derivative. Optimization problems.  Inverse functions. The indefinite integral. The definite integral. Applications of the definite integral: arc length, volume and surface area of solid of revolution.  Logarithmic and exponential functions. Techniques of Integration. Taylor\u0027s Formula. Differential equations. Some applications in Business, Economics and Social Sciences.","moduleCredit":4.0,"department":"Mathematics","faculty":"Science","prerequisite":"AO-Level Mathematics or H1 Mathematics or MA1301 or MA1301FC or MA1301X","preclusion":"MA1102R, MA1505, MA1505C, MA1521, MA1511, MA2002, FoE students,","acadYear":"2021/2022","attributes":{"mpes1":false,"mpes2":true,"su":true},"semesterData":[{"semester":2,"examDate":"May 4, 2022, 9:00:00 AM","examDuration":120,"timetable":[{"classNo":"1","startTime":1400,"endTime":1600,"venue":"LT31","day":"Monday","lessonType":"Lecture","size":190},{"classNo":"1","startTime":1200,"endTime":1300,"venue":"S17-0611","day":"Wednesday","lessonType":"Tutorial","size":30},{"classNo":"3","startTime":1600,"endTime":1700,"venue":"S17-0611","day":"Friday","lessonType":"Tutorial","size":30},{"classNo":"1","startTime":1400,"endTime":1600,"venue":"LT26","day":"Thursday","lessonType":"Lecture","size":190},{"classNo":"2","startTime":1300,"endTime":1400,"venue":"S17-0611","day":"Wednesday","lessonType":"Tutorial","size":30},{"classNo":"4","startTime":1700,"endTime":1800,"venue":"S17-0611","day":"Friday","lessonType":"Tutorial","size":30}]}]}