{"moduleCode":"MA2216","title":"Probability","description":"The objective of this module is to give an elementary introduction to probability theory for science (including computing science, social sciences and management sciences) and engineering students with knowledge of elementary calculus. It will cover not only the mathematics of probability theory but\nwill work through many diversified examples to illustrate the wide scope of applicability of probability. Topics covered are: counting methods, sample space and events, axioms of probability, conditional probability, independence, random variables, discrete and continuous distributions, joint and marginal distributions, conditional distribution, independence of random variables, expectation,\nconditional expectation, moment generating function, central limit theorem, the weak law of large numbers. This module is targeted at students who are interested in Statistics and are able to meet the prerequisite. It is an essential module for Industrial and Systems Engineering students.","moduleCredit":4.0,"department":"Mathematics","faculty":"Science","prerequisite":"MA1102R or MA2002 or MA1312 or MA1507 or MA1505 or MA1505C or MA1511 or MA1521","preclusion":"ST2131 (Cross-listing), ST2334, CE2407, YSC2243","acadYear":"2021/2022","attributes":{"mpes1":true,"mpes2":true,"su":false},"semesterData":[{"semester":1,"examDate":"Dec 1, 2021, 1:00:00 PM","examDuration":120,"timetable":[{"classNo":"1","startTime":1600,"endTime":1800,"venue":"E-Learn_B","day":"Thursday","lessonType":"Lecture","size":115}]},{"semester":2,"examDate":"Apr 30, 2022, 9:00:00 AM","examDuration":120,"timetable":[{"classNo":"1","startTime":1800,"endTime":2000,"venue":"LT28","day":"Tuesday","lessonType":"Lecture","size":63},{"classNo":"2","startTime":1800,"endTime":2000,"venue":"LT29","day":"Wednesday","lessonType":"Lecture","size":62},{"classNo":"1","startTime":1800,"endTime":2000,"venue":"LT28","day":"Friday","lessonType":"Lecture","size":63},{"classNo":"2","startTime":1800,"endTime":2000,"venue":"LT29","day":"Monday","lessonType":"Lecture","size":62}]}]}