{"moduleCode":"MA2311","title":"Techniques in Advanced Calculus","description":"This module applies advanced calculus to practical, computational and mathematical problems. It covers the approximation of a general function by polynomials, the defining equations of lines and planes, the method to find maximum or minimum of a function, as well as the calculation of area, volume, surface area, mass, centre of gravity. The course is for students with advanced calculus background and with interest in the applications of calculus. \n\n\n\nMajor topics: Sequences. Monotone convergence theorem. Series. Absolute and conditional convergence. Tests of convergence. Power series and interval of convergence. Taylor\u0027s series. Differentiation and integration of power series. Vector algebra in R2 and R3. Dot product and cross product. Functions of several variables. Limits and continuity. Partial derivatives. Total differentials. Directional derivatives. Gradients of functions. Mean value theorem. Taylor\u0027s formula. Maximum and minimum. Second derivative test. Vector valued functions of several variables. Jacobians. Chain rule. Tangent planes and normal lines to surfaces in R3. Lagrange\u0027s multiplier method. Multiple integrals. Iterated integrals. Change of order of integration. Change of variable formula for multiple integrals.","moduleCredit":4.0,"department":"Mathematics","faculty":"Science","prerequisite":"MA1102R or MA2002 or MA1312 or MA1421 or MA1521","preclusion":"MA1104, MA2104, MA1505, MA1507, MA1511, MA2108, MA2108S, MPE students, Mathematics majors, Applied Mathematics majors, Quantitative Finance majors, second major in Mathematics, second major in Financial Mathematics","acadYear":"2021/2022","attributes":{"mpes1":true,"mpes2":false,"su":false},"semesterData":[{"semester":1,"examDate":"Nov 23, 2021, 5:00:00 PM","examDuration":120,"timetable":[{"classNo":"1","startTime":1000,"endTime":1200,"venue":"E-Learn_B","day":"Friday","lessonType":"Lecture","size":200},{"classNo":"1","startTime":1000,"endTime":1200,"venue":"E-Learn_B","day":"Tuesday","lessonType":"Lecture","size":200}]}]}