{"acadYear":"2021/2022","description":"This module provides an introduction to the physics of nanostructures. Students taking this module will be introduced methods of fabrication and characterization of nanostructured materials and nanodevices, common types of nanostructures, their properties and applications. More importantly, the underlying physics of the intricate properties and functions of nanostructures will be discussed. The module starts with a brief review of relevant topics of quantum mechanics and solid state physics in reduced dimensions. Common techniques for nanostructure fabrication and characterization are introduced next. Transport in low-dimensional systems, optoelectronics of nanostructures, nanotubes and nanowires, clusters and nanocrystallites are discussed. Finally, magnetic nanostructures, and molecular electronics (optional), will be covered. This module is designed for postgraduate students who are interested in nanoscience and nanotechnology research and applications. Understanding the physics of nanostructures will allow the students to better appreciate the interesting properties and their tunability of nanostructures, understand the operating principles of nanodevices, and to design and optimize nanostructures for different applications.","title":"Physics of Nanostructures","department":"Physics","faculty":"Science","workload":[3.5,0.5,0,2,4],"prerequisite":"Students who have passed one of these modules. PC4130, PC4240, PC4201 (old code), PC4214 (old code), or Departmental Approval","moduleCredit":"4","moduleCode":"PC5212","attributes":{"mpes2":true},"semesterData":[{"semester":2,"timetable":[{"classNo":"1","startTime":"1800","endTime":"2000","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"S12-0403","day":"Friday","lessonType":"Lecture","size":45,"covidZone":"B"},{"classNo":"1","startTime":"1800","endTime":"2000","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"S12-0403","day":"Wednesday","lessonType":"Lecture","size":45,"covidZone":"B"}],"covidZones":["B"],"examDate":"2022-05-06T06:30:00.000Z","examDuration":120}],"prereqTree":{"or":["PC4130","PC4240","PC4201","PC4214"]}}
