{"moduleCode":"PC5247","title":"Photonics II","description":"The module is intended to provide detailed treatment of the principles of lasers and working knowledge of major optical techniques used in manipulating laser spatial mode properties and their temporal and spectral characteristics. The topics being covered include laser beams, laser theory, laser survey, modulation techniques, non-linear optics, and fiber optics. This is a graduate-level module and is to prepare students for using lasers and related techniques in either academic research or industrial R\u0026D. Students will acquire a solid understanding of laser principles, will learn characteristics and applications of various types of lasers, and will become familiar with major techniques on manipulating laser outputs based on electro-optic, acousto-optic, and non-linear effects for different kinds of applications. At the end of the module, students will be equipped with sufficient theoretical and working knowledge to effectively apply commercially available laser instruments in their research as well as build from basic optical components their own coherent light sources where lasers for particular experiments and applications may not be readily available.  This module should be relevant to any student who is or will be working in R\u0026D areas involving laser-related techniques.","moduleCredit":4.0,"department":"Physics","faculty":"Science","prerequisite":"PC3247: Modern Optics, or equivalent.","corequisite":"Familiar with electromagnetism (including Maxwell’s equations), and with the mathematics of differential equations, complex number, basic Fourier transform theory.","acadYear":"2021/2022","attributes":{"mpes1":false,"mpes2":true,"su":false},"semesterData":[{"semester":2,"examDate":"May 4, 2022, 5:00:00 PM","examDuration":120,"timetable":[{"classNo":"1","startTime":1200,"endTime":1400,"venue":"S14-0620","day":"Thursday","lessonType":"Lecture","size":42},{"classNo":"1","startTime":1400,"endTime":1600,"venue":"S14-0619","day":"Tuesday","lessonType":"Lecture","size":42}]}]}