{"acadYear":"2021/2022","description":"This course gives an in-depth introduction to the field of Ion Beam Analysis (IBA). IBA methods allow the composition of unknown material systems to be quantitatively determined through the use of ion beams that are produced by small particle accelerators. Theoretical fundamentals will be covered in detail, e.g. Thomas-Fermi statistical model, screened inter-atomic potentials, scattering cross sections, stopping powers etc. Accelerators, detectors and basic pulse processing instrumentation will be discussed. A range of analytical techniques will be discussed in detail: Rutherford Backscattering (RBS), Proton Induced X-ray Emission (PIXE), Elastic Recoil Detection Analysis (ERDA), Nuclear Reaction Analysis NRA, and Accelerator Mass Spectrometry (AMS). Apart from academic content, students will be required to engage in group discussions and work on group research projects that involve performing literature review, producing a conference poster as well as giving an individual oral presentation. Through these discussions and projects, students will gain experience in real-world skills of teamwork, online literature search, academic writing, design of conference posters and giving academic oral presentations.","title":"Accelerator Based Materials Characterisation","department":"Physics","faculty":"Science","workload":[3,1,0,1,5],"prerequisite":"Students who have passed either one of these modules. PC4244, PC4212, PC4261, or Departmental Approval","moduleCredit":"4","moduleCode":"PC5209","attributes":{"mpes1":true},"semesterData":[{"semester":1,"timetable":[{"classNo":"1","startTime":"1000","endTime":"1200","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"E-Learn_B","day":"Wednesday","lessonType":"Lecture","size":45,"covidZone":"Unknown"},{"classNo":"1","startTime":"1000","endTime":"1200","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"E-Learn_B","day":"Monday","lessonType":"Lecture","size":45,"covidZone":"Unknown"}],"covidZones":["Unknown"]}],"prereqTree":{"or":["PC4244","PC4212","PC4261"]}}
