{"moduleCode":"PR4195","title":"Scientific Evaluation, Analysis and Communication","description":"This module aims to equip final pharmacy students with the skills\nof performing a literature-based scientific evaluation study in\npharmaceutical science or pharmacy practice. It also aims to\nhelp students develop higher-order thinking and communication\nskills through critical review and analysis of literature as well as\nvia a technical oral presentation. Students will perform their\nstudy under the supervision of Pharmacy academic staff with the\nfinal output as a written report in the format of a review paper.\nThey will attend classes offered by Centre for English Language\nCommunication (CELC) to gain knowledge and skills required for\nsuccessful scientific communication.","moduleCredit":12.0,"department":"Pharmacy","faculty":"Science","prerequisite":"Completion of Pharmacy Year 3 requirement and have not met\nthe criteria for reading PR4196 as listed below:\n(i) Students who are not within the 50th percentile of the cohort based on their Year 3 Semester 1 CAP score.\n(ii) Student who are deemed by the HOD and/or department’s\ndesignated representatives to be unsuitable to read\nPR4196 due to medical, personal and safety reasons. For\npoint \n(ii), accompanying document from a medical\npractitioner or testimonial from the students’ supervisor will\nbe needed to aid in the decision making by the HOD and/or\ndepartment’s designated representatives.\n(iii) Students who are required to read ES1000/ES1000FC\nBasic English and/or ES1102 English for Academic\nPurposes must pass these modules.","preclusion":"Students from non-Pharmacy majors, PR4196 unless deemed\nunsuitable by the HOD or her representatives","acadYear":"2021/2022","semesterData":[{"semester":1,"examDuration":0,"timetable":[{"classNo":"1","startTime":900,"endTime":1200,"venue":"S14-0620","day":"Tuesday","lessonType":"Seminar-Style Module Class","size":25},{"classNo":"2","startTime":1400,"endTime":1700,"venue":"S14-0620","day":"Tuesday","lessonType":"Seminar-Style Module Class","size":25}]},{"semester":2,"examDuration":0,"timetable":[{"classNo":"2","startTime":1400,"endTime":1700,"venue":"S16-0309","day":"Tuesday","lessonType":"Seminar-Style Module Class","size":25},{"classNo":"1","startTime":900,"endTime":1200,"venue":"S16-0309","day":"Wednesday","lessonType":"Seminar-Style Module Class","size":25}]}]}